app/Views/auth/dashboard.php

SELECT *
FROM `users`
WHERE `role` = 'student'
AND `status` = 'active'
---
                            <?php if (!empty($all_courses)): ?>
                                <?php
                                $userModel = new \App\Models\UserModel();
                                $teachers = $userModel->where('role', 'teacher')->where('status', 'active')->findAll();