app/Controllers/AdminCourses.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
---
    public function update($courseId)
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $courseModel = new CourseModel();
        $course = $courseModel->find($courseId);

UPDATE `courses` SET `course_code` = 'CS101', `title` = 'Introduction to Programming', `description` = 'Learn the fundamentals of programming using Python. This course covers variables, control structures, functions, and basic data structures.', `teacher_id` = '2', `department` = 'Computer Science', `units` = '3', `year_level` = '1', `program_id` = NULL, `max_students` = NULL, `lecture_hours` = '2', `lab_hours` = '3', `room` = 'Room 201', `schedule_days` = 'TTH', `schedule_time` = '1:00-4:00 pm', `prerequisite_course_ids` = NULL, `status` = 'active', `updated_at` = '2025-12-11 16:35:13'
WHERE `courses`.`id` IN ('1')
---
            }

            try {
                $result = $courseModel->update($courseId, $updateData);