app/Controllers/Auth.php

SELECT *
FROM `courses`
WHERE `teacher_id` = '2'
---

        else if ($role === 'teacher') {
            if ($this->db->tableExists('courses')) {
                $data['courses'] = $this->db->table('courses')
                    ->where('teacher_id', $userId)
                    ->get()->getResultArray();