app/Controllers/Auth.php

    public function dashboard()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'))->with('error', 'Please log in to access the dashboard');
        }


        $role = session()->get('role');
        $userId = session()->get('user_id');
        $name = session()->get('name');


        $data = [
            'title' => ucfirst($role) . ' Dashboard',
            'role' => $role,
            'user_id' => $userId,
            'name' => $name
        ];


        switch ($role) {
            case 'admin':

                // Count only active users (not soft-deleted)
                $data['total_teachers'] = $this->db->table('users')->where('role', 'teacher')->where('status', 'active')->countAllResults();
                $data['total_students'] = $this->db->table('users')->where('role', 'student')->where('status', 'active')->countAllResults();
                $data['total_courses'] = $this->db->tableExists('courses') ?
                    $this->db->table('courses')->countAllResults() : 0;


                // Show only active users (not soft-deleted)
                $data['users'] = $this->db->table('users')
                    ->select('id, name, email, role, created_at')
                    ->where('status', 'active')
                    ->orderBy('created_at', 'DESC')
                    ->limit(10)
                    ->get()->getResultArray();

                // Get all courses with teacher names (exclude soft-deleted teachers)
                if ($this->db->tableExists('courses')) {
                    $data['all_courses'] = $this->db->table('courses')
                        ->select('courses.*, users.name as teacher_name')
                        ->join('users', 'users.id = courses.teacher_id AND users.status = \'active\'', 'left')
                        ->orderBy('courses.created_at', 'DESC')
                        ->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT `id`, `name`, `email`, `role`, `created_at`
FROM `users`
WHERE `status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT `courses`.*, `users`.`name` as `teacher_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id` AND `users`.`status` = 'active'
ORDER BY `courses`.`created_at` DESC

                    // Add student count for each course
                    foreach ($data['all_courses'] as &$course) {
                        if ($this->db->tableExists('enrollments')) {
                            $course['students_count'] = $this->db->table('enrollments')
                                ->where('course_id', $course['id'])
                                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '6'

                $data['upcoming_assignments'] = $assignmentModel->getUpcomingAssignmentsForStudent($userId);

                // Get student info for filtering
                $student = $this->db->table('users')->where('id', $userId)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '4'

                    // Get IDs of courses the student is already enrolled in OR completed
                    $enrolledCourseIds = [];
                    if ($this->db->tableExists('enrollments')) {
                        $enrolledCourseIds = $this->db->table('enrollments')
                            ->select('course_id')
                            ->where('user_id', $userId)
                            ->get()
                            ->getResultArray();
---
SELECT `course_id`
FROM `enrollments`
WHERE `user_id` = '4'

                    $excludedCourseIds = array_merge($enrolledCourseIds, $completedCourseIds);

                    // Get ALL active courses (not enrolled and not completed) - same as advanced search
                    $builder = $this->db->table('courses')
                        ->select('courses.*, users.name as teacher_name')
                        ->join('users', 'users.id = courses.teacher_id AND users.status = \'active\'')
                        ->where('courses.status', 'active');
---
SELECT `courses`.*, `users`.`name` as `teacher_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`teacher_id` AND `users`.`status` = 'active'
WHERE `courses`.`status` = 'active'
AND `courses`.`id` NOT IN ('1','2','3','6')

                }

                // Get the total courses count
                $totalCourses = $this->db->table('enrollments')->where('user_id', $userId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '4'