app/Controllers/Auth.php

SELECT `id`, `name`, `email`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function dashboard()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please log in to access the dashboard');
        }


        $role = session()->get('role');
        $userId = session()->get('user_id');
        $name = session()->get('name');


        $data = [
            'title' => ucfirst($role) . ' Dashboard',
            'role' => $role,
            'user_id' => $userId,
            'name' => $name
        ];


        switch ($role) {
            case 'admin':

                $data['total_teachers'] = $this->db->table('users')->where('role', 'teacher')->countAllResults();
                $data['total_students'] = $this->db->table('users')->where('role', 'student')->countAllResults();
                $data['total_courses'] = $this->db->tableExists('courses') ?
                    $this->db->table('courses')->countAllResults() : 0;


                $data['users'] = $this->db->table('users')
                    ->select('id, name, email, role, created_at')
                    ->orderBy('created_at', 'DESC')
                    ->limit(10)
                    ->get()->getResultArray();

SELECT `id`, `title`, `description`
FROM `courses`
WHERE `teacher_id` = '2'
---


                $data['courses'] = $this->db->tableExists('courses') ?
                    $this->db->table('courses')
                        ->where('teacher_id', $userId)
                        ->select('id, title, description')
                        ->get()->getResultArray() : [];

SELECT `course_id`
FROM `enrollments`
WHERE `user_id` = '4'
---
                    // Get IDs of courses the student is already enrolled in
                    $enrolledCourseIds = [];
                    if ($this->db->tableExists('enrollments')) {
                        $enrolledCourseIds = $this->db->table('enrollments')
                            ->select('course_id')
                            ->where('user_id', $userId)
                            ->get()
                            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '4'
---
                }

                // Get the total courses count
                $totalCourses = $this->db->table('enrollments')->where('user_id', $userId)->countAllResults();

SELECT `enrollments`.*, `courses`.`title`, `courses`.`description`, `users`.`name` as `teacher_name`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `enrollments`.`user_id` = '4'
---

                // Get enrolled courses
                if ($this->db->tableExists('enrollments')) {
                    $data['enrolled_courses'] = $this->db->table('enrollments')
                        ->select('enrollments.*, courses.title, courses.description, users.name as teacher_name')
                        ->join('courses', 'courses.id = enrollments.course_id')
                        ->join('users', 'users.id = courses.teacher_id')
                        ->where('enrollments.user_id', $userId)
                        ->get()
                        ->getResultArray();

SELECT `materials`.*, `courses`.`title` as `course_title`, `courses`.`course_code`
FROM `materials`
JOIN `courses` ON `courses`.`id` = `materials`.`course_id`
WHERE `materials`.`course_id` IN ('6','7','8','9','10','12')
ORDER BY `materials`.`created_at` DESC
---
                $enrolledCourseIds = array_column($data['enrolled_courses'], 'course_id');
                $data['materials'] = [];
                if (!empty($enrolledCourseIds) && $this->db->tableExists('materials')) {
                    $data['materials'] = $this->db->table('materials')
                        ->select('materials.*, courses.title as course_title, courses.course_code')
                        ->join('courses', 'courses.id = materials.course_id')
                        ->whereIn('materials.course_id', $enrolledCourseIds)
                        ->orderBy('materials.created_at', 'DESC')
                        ->get()
                        ->getResultArray();