app/Controllers/Course.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'
---

        // Check if course matches student's program and year level (real-world restriction)
        $userModel = new \App\Models\UserModel();
        $student = $userModel->find($userId);
        $course = $courseModel->find($courseId);