app/Controllers/Notifications.php

    public function mark_as_read($id)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'User not logged in'
            ])->setStatusCode(401);
        }

        $userId = session()->get('user_id');

        // Get the notification to verify ownership
        $notification = $this->notificationModel->find($id);
---
SELECT *
FROM `notifications`
WHERE `notifications`.`id` = '1'