app/Controllers/TeacherController.php

SELECT *
FROM `courses`
WHERE `teacher_id` = '2'
---
    public function dashboard()
    {
        // Authorization check
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Verify correct role
        if (session()->get('role') !== 'teacher') {
            return redirect()->to('/login')->with('error', 'You do not have permission to access the teacher dashboard.');
        }

        // Get teacher ID
        $teacherId = session()->get('user_id');

        // Prepare data for dashboard view
        $data = [
            'title' => 'Teacher Dashboard',
            'name' => session()->get('name'),
        ];

        // Get teacher's courses if available
        if ($this->db->tableExists('courses')) {
            $coursesBuilder = $this->db->table('courses');
            $data['courses'] = $coursesBuilder->where('teacher_id', $teacherId)->get()->getResultArray();