app/Models/AcademicYearModel.php

SELECT *
FROM `academic_years`
WHERE `is_current` = 1
 LIMIT 1
---
    public function getCurrentAcademicYear()
    {
        return $this->where('is_current', 1)->first();