app/Models/AssignmentModel.php

SELECT `assignments`.*, `courses`.`title` as `course_title`, `courses`.`course_code`, `assignment_submissions`.`status` as `submission_status`
FROM `assignments`
JOIN `courses` ON `courses`.`id` = `assignments`.`course_id`
JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`id` AND `enrollments`.`user_id` = 4
LEFT JOIN `assignment_submissions` ON `assignment_submissions`.`assignment_id` = `assignments`.`id` AND `assignment_submissions`.`user_id` = 4
WHERE `assignments`.`status` = 'active'
AND `assignments`.`due_date` >= '2025-12-12 06:55:07'
ORDER BY `assignments`.`due_date` ASC
---
    public function getUpcomingAssignmentsForStudent($user_id)
    {
        return $this->select('assignments.*, courses.title as course_title, courses.course_code, assignment_submissions.status as submission_status')
            ->join('courses', 'courses.id = assignments.course_id')
            ->join('enrollments', 'enrollments.course_id = courses.id AND enrollments.user_id = ' . $user_id)
            ->join('assignment_submissions', 'assignment_submissions.assignment_id = assignments.id AND assignment_submissions.user_id = ' . $user_id, 'left')
            ->where('assignments.status', 'active')
            ->where('assignments.due_date >=', date('Y-m-d H:i:s'))
            ->orderBy('assignments.due_date', 'ASC')
            ->findAll();