app/Models/CompletedCourseModel.php

    public function getUserCompletedCourses($userId)
    {
        return $this->select('completed_courses.*, courses.title as course_name, courses.course_code as course_code')
            ->join('courses', 'courses.id = completed_courses.course_id')
            ->where('completed_courses.user_id', $userId)
            ->orderBy('completed_courses.completed_date', 'DESC')
            ->findAll();
---
SELECT `completed_courses`.*, `courses`.`title` as `course_name`, `courses`.`course_code` as `course_code`
FROM `completed_courses`
JOIN `courses` ON `courses`.`id` = `completed_courses`.`course_id`
WHERE `completed_courses`.`user_id` = '4'
ORDER BY `completed_courses`.`completed_date` DESC