app/Models/CourseModel.php

SELECT `courses`.*, `users`.`name` as `teacher_name`, `users`.`email` as `teacher_email`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `courses`.`id` = '2'
AND `courses`.`status` = 'active'
AND `users`.`status` = 'active'
 LIMIT 1
---
    public function getCourseWithTeacher($courseId)
    {
        return $this->select('courses.*, users.name as teacher_name, users.email as teacher_email')
                    ->join('users', 'users.id = courses.teacher_id')
                    ->where('courses.id', $courseId)
                    ->where('courses.status', 'active')
                    ->where('users.status', 'active')
                    ->first();

SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'
---
    public function hasAvailableSeats($courseId)
    {
        $course = $this->find($courseId);

SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'
UPDATE `courses` SET `current_enrolled` = 1, `updated_at` = '2025-12-11 14:23:23'
WHERE `courses`.`id` IN ('2')
---
    public function incrementEnrolled($courseId)
    {
        $course = $this->find($courseId);

        if (!$course) {
            return false;
        }

        $currentEnrolled = $course['current_enrolled'] ?? 0;
        return $this->update($courseId, [
            'current_enrolled' => $currentEnrolled + 1
        ]);

SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'
---
    public function hasPrerequisites($courseId, $userId)
    {
        $course = $this->find($courseId);