app/Models/EnrollmentInvitationModel.php

    public function getPendingInvitationsForStudent($userId)
    {
        return $this->select('enrollment_invitations.*,
                             courses.title as course_title,
                             courses.course_code,
                             courses.description as course_description,
                             inviter.name as invited_by_name,
                             inviter.role as invited_by_role')
                    ->join('courses', 'courses.id = enrollment_invitations.course_id')
                    ->join('users as inviter', 'inviter.id = enrollment_invitations.invited_by', 'left')
                    ->where('enrollment_invitations.user_id', $userId)
                    ->where('enrollment_invitations.type', 'invitation')
                    ->where('enrollment_invitations.status', 'pending')
                    ->orderBy('enrollment_invitations.created_at', 'DESC')
                    ->findAll();
---
SELECT `enrollment_invitations`.*, `courses`.`title` as `course_title`, `courses`.`course_code`, `courses`.`description` as `course_description`, `inviter`.`name` as `invited_by_name`, `inviter`.`role` as `invited_by_role`
FROM `enrollment_invitations`
JOIN `courses` ON `courses`.`id` = `enrollment_invitations`.`course_id`
LEFT JOIN `users` as `inviter` ON `inviter`.`id` = `enrollment_invitations`.`invited_by`
WHERE `enrollment_invitations`.`user_id` = '4'
AND `enrollment_invitations`.`type` = 'invitation'
AND `enrollment_invitations`.`status` = 'pending'
ORDER BY `enrollment_invitations`.`created_at` DESC

    public function getAllPendingRequests()
    {
        return $this->select('enrollment_invitations.*,
                             users.name as student_name,
                             users.email as student_email,
                             users.student_id,
                             courses.title as course_title,
                             courses.course_code,
                             teacher.name as teacher_name')
                    ->join('users', 'users.id = enrollment_invitations.user_id')
                    ->join('courses', 'courses.id = enrollment_invitations.course_id')
                    ->join('users as teacher', 'teacher.id = courses.teacher_id', 'left')
                    ->where('enrollment_invitations.type', 'request')
                    ->where('enrollment_invitations.status', 'pending')
                    ->orderBy('enrollment_invitations.created_at', 'DESC')
                    ->findAll();
---
SELECT `enrollment_invitations`.*, `users`.`name` as `student_name`, `users`.`email` as `student_email`, `users`.`student_id`, `courses`.`title` as `course_title`, `courses`.`course_code`, `teacher`.`name` as `teacher_name`
FROM `enrollment_invitations`
JOIN `users` ON `users`.`id` = `enrollment_invitations`.`user_id`
JOIN `courses` ON `courses`.`id` = `enrollment_invitations`.`course_id`
LEFT JOIN `users` as `teacher` ON `teacher`.`id` = `courses`.`teacher_id`
WHERE `enrollment_invitations`.`type` = 'request'
AND `enrollment_invitations`.`status` = 'pending'
ORDER BY `enrollment_invitations`.`created_at` DESC