app/Models/EnrollmentModel.php

    public function enrollUser($data)
    {
        // Add enrollment date if not provided
        if (!isset($data['enrollment_date'])) {
            $data['enrollment_date'] = date('Y-m-d H:i:s');
        }

        // Verify required fields exist
        if (!isset($data['user_id']) || !isset($data['course_id'])) {
            return false;
        }

        // Check if already enrolled
        if ($this->isAlreadyEnrolled($data['user_id'], $data['course_id'])) {
            return false; // Already enrolled
        }

        // Insert the enrollment record
        return $this->insert($data);
---
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`) VALUES ('4', '2', '2025-12-11 14:23:23')

    public function isAlreadyEnrolled($user_id, $course_id)
    {
        $result = $this->where('user_id', $user_id)
            ->where('course_id', $course_id)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '4'
AND `course_id` = '2'

    public function enrollUserWithTransaction($data)
    {
        $db = \Config\Database::connect();
        $db->transStart();

        try {
            // Enroll the user
            $enrollmentId = $this->enrollUser($data);

            if (!$enrollmentId) {
                $db->transRollback();
                return [
                    'success' => false,
                    'message' => 'Failed to create enrollment record'
                ];
            }

            // Increment course enrolled count
            $courseModel = new \App\Models\CourseModel();
            if (!$courseModel->incrementEnrolled($data['course_id'])) {
                $db->transRollback();
                return [
                    'success' => false,
                    'message' => 'Failed to update course enrollment count'
                ];
            }

            // Get course details for notification
            $course = $courseModel->find($data['course_id']);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'