app/Models/MaterialModel.php

INSERT INTO `materials` (`course_id`, `file_name`, `file_path`, `created_at`) VALUES ('10', 'MidtermExamination.docx', 'writable/uploads/materials/1760667479_23381628e18cc1fba7f2.docx', '2025-10-17 02:17:59')
---
    public function insertMaterial($data)
    {
        try {
            return $this->insert($data, false);