app/Models/NotificationModel.php

    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '4'
ORDER BY `created_at` DESC
 LIMIT 10

    public function markAsRead($notificationId)
    {
        return $this->update($notificationId, ['is_read' => 1]);
---
UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN ('1')

    public function createNotification($userId, $message)
    {
        $data = [
            'user_id'    => $userId,
            'message'    => $message,
            'is_read'    => 0,
            'created_at' => date('Y-m-d H:i:s')
        ];
        return $this->insert($data);
---
INSERT INTO `notifications` (`user_id`, `message`, `is_read`, `created_at`) VALUES ('4', 'You have been enrolled in Web Technologies', 0, '2025-12-11 14:23:23')