app/Models/UserModel.php

    public function getAllUsersWithStatus()
    {
        return $this->db->table($this->table)
            ->select('id, name, email, role, status, created_at, updated_at')
            ->where('status', 'active')
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`, `email`, `role`, `status`, `created_at`, `updated_at`
FROM `users`
WHERE `status` = 'active'
ORDER BY `created_at` DESC